[Language]
LANGUAGE=简体中文
CHARACTER_CODE=Unicode (UTF-16, LE, w/ BOM)
; Locale ID: https://docs.microsoft.com/previous-versions/windows/embedded/ms912047(v=winembedded.10)
LOCALE_ID=0x0004, 0x0804, 0x1004, 0x7804

[Url]
WIKIPEDIA_SMART=https://zh.wikipedia.org/wiki/S.M.A.R.T.

[DiskStatus]
GOOD=良好
CAUTION=警告
BAD=不良
UNKNOWN=未知
DISK=硬盘

[Smart]
UNKNOWN=未知项目
VENDOR_SPECIFIC=由厂商定义
01=读取错误率
02=吞吐性能
03=起转用时
04=启停次数
05=重新分配扇区数
06=读取通道余量
07=寻道错误率
08=寻道时间性能
09=通电时间(小时)
0A=起转重试次数
0B=重新校准重试次数
0C=通电次数
0D=软读取错误率探针
16=目前氦气水平
B8=端到端错误
BB=报告的不可校正错误
BC=命令超时
BD=磁头非正常高度写入
BE=气流温度
BF=加速度感应错误率
C0=断电磁头缩回计数
C1=磁头加载/卸载循环计数
C2=温度
C3=硬件 ECC 校正计数
C4=扇区物理位置重分配事件计数(与坏道相关)
C5=有待处置扇区数(状态存疑-需保持关注)
C6=不可校正的扇区数
C7=UltraDMA CRC 错误计数(与数据线或接口相关)
C8=写入错误率
C9=软读取错误率
CA=数据地址标记错误
CB=校验和错误
CC=软 ECC 校正
CD=热骚动率(高温导致的出错)
CE=磁头飞行高度
CF=起转最大电流
D0=起转蜂鸣/起转阶梯(欠压启动时马达加速的流程数)
D1=离线寻道性能
D3=写入期间振动(振荡)
D4=写入期间震动(冲击)
DC=盘片位移
DD=加速度感应错误率
DE=加载所用小时数(磁头电机运转)
DF=加载/卸载重试计数
E0=加载摩擦
E1=加载/卸载循环计数
E2=磁头待命时间总计(磁头从停泊区伸出)
E3=扭矩放大计数
E4=断电磁头缩回计数
E6=巨磁阻磁头振幅
E7=温度
F0=磁头飞行小时数
FA=读取错误重试率
FE=自由落体保护

;Updated 5.4.0
F1=主机总计写入
F2=主机总计读取

;Updated 9.5.0
17=氦气状态下限
18=氦气状态上限
1B=MAMR 健康监控

[SmartSsd]
01=读取错误率
02=吞吐性能
03=启动时间
04=启动-停止次数
05=重新分配扇区计数
06=读取通道余量
07=寻址错误率
08=寻址时间性能
09=通电时间(小时)
0A=启动重试次数
0B=重新校准重试次数
0C=通电次数
0D=软读取错误率探针
C0=不安全关机计数
C2=温度
C4=扇区位置重分配事件计数
C5=有待处置扇区数
C6=不可校正的扇区数
; CrystalDiskInfo assign
FF=剩余寿命

;Updated 5.4.0
F1=主机总计写入
F2=主机总计读取

[SmartMtron]
BB=总计擦除计数

[SmartIndilinx]
01=读取错误率
09=通电时间(小时)
0C=通电次数
B8=出厂坏块计数
C2=温度
C3=编程失败块数
C4=擦除失败块数
C5=读取失败块数
C6=读取扇区数总计
C7=写入扇区数总计
C8=读取命令数总计
C9=写入命令数总计
CA=闪存比特位出错数总计
CB=读取扇区遇可校正比特位错误总计
CC=坏块满标志
CD=最大 PE(编程/擦除) 次数规格
CE=最小擦除计数
CF=最大擦除计数
D0=平均擦除计数
D1=剩余使用寿命

[SmartJMicron60x]
09=通电时间(小时)
0C=通电次数
C2=温度
E5=Half 系统 ID，闪存 ID
E8=固件版本信息
E9=ECC 失败记录
EA=平均擦除计数，最大擦除计数
EB=良好块计数，系统块计数

[SmartIntel]
03=启动时间
04=启动停止次数
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
AA=可用保留空间
AB=编程失败计数
AC=擦除失败计数
AE=意外断电
AF=掉电保护失败
B7=SATA 接口性能降级计数
B8=端到端错误检测计数
BB=不可校正错误计数
BE=温度
C0=不安全关闭计数
C2=温度
C5=有待处置扇区数
C7=CRC 错误计数
E1=主机写入
E2=周期内负载介质磨损
E3=周期内负载主机读/写比率 (读操作占比)
E4=周期内负载计时器
E8=可用保留空间
E9=介质磨损指示器
EA=温控状态
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计
F3=NAND 写入量总计
F9=NAND 写入量总计

[SmartSamsung] ;Updated 6.6
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
AF=编程失败计数(芯片)
B0=擦除失败计数(芯片)
B1=闪存磨损平均计数
B2=已使用的保留块计数(芯片)
B3=已使用的保留块计数(总计)
B4=未使用的保留块计数(总计)
B5=编程失败计数(总计)
B6=擦除失败计数(总计)
B7=运行中的坏块(总计)
BB=不可校正错误计数
BE=气流温度
C2=温度
C3=ECC 错误率
C6=离线不可校正错误计数
C7=CRC 错误计数
C9=断电保护电容状态
CA=SSD 模式状态
EB=电源恢复计数(意外断电的次数)
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计

;Added 6.6
AA=未使用保留块计数(芯片)
AB=编程失败计数(芯片)
AC=擦除失败计数(芯片)
AD=闪存磨损平均计数
AE=意外断电计数
B8=错误检测
E9=标准化后的介质磨损

[SmartSandForce] ;Updated 3.7.0
01=原始读取错误率
05=老化块数
09=通电时间(小时)
0C=通电次数
0D=软读取错误率
64=已擦除 GiB
AA=保留块计数
AB=编程失败计数
AC=擦除失败计数
AE=意外断电计数
B1=磨损率差异(磨损最严重与最轻的块的差异)
B5=编程失败计数
B6=擦除失败计数
B8=已报告的 I/O 检错码错误
BB=已报告的不可校正错误
C2=温度
C3=自适应 ECC 不可校正错误计数
C4=重新分配事件计数
C6=不可校正扇区计数
C7=SATA 除错(CRC)错误计数
C9=不可校正的软读取错误率
CC=软 ECC 校正率
E6=驱动器寿命保护状态
E7=SSD 剩余寿命
E8=可用保留空间
EB=断电保护电容状态
F1=主机总计写入
F2=主机总计读取

[SmartJMicron61x] ;Added 3.9.0
01=读取错误率
02=吞吐性能
03=启动时间
05=重新分配扇区计数
07=寻址错误率
08=寻址时间性能
09=通电时间(小时)
0A=启动重试次数
0C=通电次数
A8=SATA 物理层错误计数
AF=坏簇表计数(ECC 失败计数)
C0=意外断电次数
C2=温度
C5=有待处置扇区数
AA=坏块计数
AD=擦除计数

[SmartMicron] ;Added 4.0.0/ Updated 6.6.0
; RAIN = Redundant Array of Independent NAND (独立 NAND 冗余阵列)
01=底层读取错误率
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
0D=软错误率
0E=设备容量(NAND)
0F=用户可用容量
10=可用备用块
11=剩余的备用块
64=擦除计数总计
AA=保留块计数
AB=编程失败计数
AC=擦除失败计数
AD=平均块擦除计数
AE=意外断电计数
B4=未使用的 NAND 保留块
B5=未对齐访问计数
B7=SATA 接口性能降级
B8=错误校正计数
BB=报告的不可校正错误
BC=命令超时计数
BD=出厂坏块计数
C2=温度
C3=累计 ECC 比特位校正次数
C4=重新分配事件计数
C5=有待处置扇区数
C6=智能离线扫描不可校正的错误计数
C7=Ultra DMA CRC 错误率
CA=已使用寿命百分比
CE=写入错误率
D2=RAIN(独立 NAND 冗余阵列)成功恢复计数
EA=读取字节数总计
F2=距离“禁止写入模式”的剩余备用块计数
F3=ECC 校正比特位计数
F4=ECC 临界事件数累计(错误率达到/超过ECC校正能力极限的次数)
F5=累计编程 NAND 页数
F6=主机扇区写入总计
F7=主机编程页数
F8=后台编程页数

; Updated 8.11.0
F9=总计刷新 ISP 计数
FA=总计执行 RefCal 计数
FB=总计 NAND Read Plane 计数 (Low 4Bytes)
FC=总计 NAND Read Plane 计数 (High 4Bytes)
FD=总计块重映射计数
FE=总计后台扫描超过限制计数
DF=总计后台扫描

[SmartMicronMU02] ;Updated 8.17.0
; RAIN = RAIN(独立 NAND 冗余阵列)
01=底层读取错误率
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
0D=软错误率
0E=设备容量(NAND)
0F=用户可用容量
10=可用备用块
11=剩余的备用块
64=擦除计数总计
AA=保留块计数
AB=编程失败计数
AC=擦除失败计数
AD=平均块擦除计数
AE=意外断电计数
B4=未使用的 NAND 保留块
B7=SATA 接口性能降级
B8=错误校正计数
BB=报告的不可校正错误
BC=命令超时计数
BD=出厂坏块计数
C2=温度
C3=累计 ECC 比特位校正计数
C4=重新分配事件计数
C5=有待处置扇区数
C6=智能离线扫描不可校正的错误计数
C7=Ultra DMA CRC 错误率
CA=已使用寿命百分比
CE=写入错误率
D2=RAIN(独立 NAND 冗余阵列)成功恢复计数
EA=读取字节数总计
F3=ECC 校正比特位计数
F4=ECC 临界事件数累计(错误率达到/超过ECC校正能力极限的次数)
F5=累计编程 NAND 页数
F6=主机扇区写入总计
F7=主机编程页数
F8=FTL 编程页数

; Updated 6.6.0
A0=不可校正扇区计数
A1=有效备用块数
A3=初始无效块数
94=SLC 总计擦除
95=SLC 最大擦除
96=SLC 最小擦除
97=SLC 平均擦除
A4=NAND 总计擦除
A5=NAND 最大擦除
A6=NAND 最小擦除
A7=NAND 平均擦除
A9=剩余寿命百分比
B5=编程失败计数
B6=擦除失败计数
C0=断电磁头缩回计数
E8=可用保留空间
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计
F5=NAND 写入总计
F6=SLC 写入总计
F7=RAID 恢复计数

; Updated 8.10.0
F9=总计刷新 ISP 计数
FA=总计执行 RefCal 计数
FB=总计 NAND Read Plane 计数 (Low 4Bytes)
FC=总计 NAND Read Plane 计数 (High 4Bytes)
FD=总计块重映射计数
FE=总计后台扫描超过限制计数
DF=总计后台扫描

[SmartOcz] ;Added 4.5.0
01=原始读取错误率
03=启动时间
04=启动-停止次数
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
C2=温度
E8=写入扇区数总计
E9=剩余寿命

; Added 6.6.0
64=总计擦除块
A7=固态硬盘保护模式 (只读不写)
A8=SATA 物理层错误计数
A9=坏块计数
AD=擦除计数
B8=出厂坏块计数
C0=意外断电计数
CA=校正成功比特位总计
CD=额定最大 PE(编程/擦除) 次数
CE=最小擦除计数
CF=最大擦除计数
D3=SATA 不可校正错误计数
D4=重试期间 NAND 页读取数
D5=简单重读尝试数
D6=自适应重读尝试数
DD=内部数据路径不可校正的错误数
DE=RAID 恢复计数
E6=掉电保护
FB=NAND 读取计数

;Updated 6.7.0
F1=主机总写入
F2=主机总读取

;Updated 9.3.1
F9=NAND 总写入

[SmartPlextor] ;Added (5.1.0)/Updated (5.4.0)
01=读取错误率
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
AA=新增坏块
AB=编程失败计数
AC=擦除失败计数
AD=平均 PE(编程/擦除) 次数
AE=意外断电计数
AF=编程失败计数(最坏情况)
B0=擦除失败计数(最坏情况)
B1=闪存磨损平均计数
B2=已使用保留区块计数(最坏情况)
B3=已使用保留块计数
B4=未使用保留块计数(总计)
B5=编程失败计数
B6=擦除失败计数
B7=SATA 接口性能降级
B8=已校正的端到端数据错误
BB=不可校正错误计数
BC=命令超时
C0=不安全关机次数
C3=ECC 率
C4=重新分配事件计数
C6=不可校正扇区计数
C7=Ultra CRC 错误计数
E8=可用保留空间
E9=NAND 已写入 (GB)
F1=主机总计写入
F2=主机总计读取

[SmartSanDisk] ;Added 5.2.0
05=已重分配的块数
09=通电时间(小时)
0C=通电次数
AA=保留块计数
AB=编程失败计数
AC=擦除失败计数
AD=平均写入/擦除计数
AE=意外断电计数
BB=报告的不可校正错误
C2=温度
E6=总计写入/擦除计数的百分比
E8=剩余寿命
EA=总计写入/擦除计数的百分比 (BC块)
F1=主机总计写入
F2=主机总计读取

[SmartOczVector] ;Added 5.3.0
05=运行中坏块累计
09=通电时间(小时)
0C=通电次数
AB=可用冗余块计数
AE=启动-关闭循环次数(意外)
BB=NAND 读取不可校正总计
C2=温度
C3=编程失败总计
C4=擦除失败总计
C5=读取失败总计(不可校正)
C6=主控读取
C7=主控写入
D0=平均擦除计数
D2=SATA CRC 错误计数
E9=剩余寿命
F9=NAND 编程总计次数

;Updated 5.5.0
F1=主机总计写入
F2=主机总计读取

;Updated 6.6.0
64=擦除块数总计
B8=出厂坏块总计
CA=读取成功校正比特位总计
CD=额定最大 PE(编程/擦除) 次数
CE=最小擦除计数
CF=最大擦除计数
D4=NAND 页读取需要重试总计
D5=简单重读总计尝试
D6=自适应重读总计尝试
DD=内部数据路径保护不可校正的错误数
DE=RAID 恢复计数
E0=保修状态
E1=DAS 极性
E2=部分电源失效(Pfail)
E6=写入控制激活标志
F9=NAND 编程总计 (页)
FB=NAND 读取总计

[SmartCorsair] ;Added 6.2.0
01=原始读取错误率
05=老化块数
09=通电时间(小时)
0C=通电次数
AA=保留块计数
AC=擦除失败计数
AE=意外断电计数
B5=编程失败计数
BB=报告的不可校正错误
C2=温度
C4=重新分配事件计数
E7=SSD 剩余寿命
F1=总计写入量 (GB)
F2=总计读取量 (GB)

[SmartToshiba] ;Added 6.2.0
01=读取错误率
02=吞吐性能
03=启动时间
04=启动-停止次数
05=重新分配扇区计数
07=寻道错误率
08=寻道时间性能
09=通电时间(小时)
0A=启动重试次数
0B=重新校准重试次数
0C=通电次数
A7=固态硬盘保护模式 (只读不写)
A8=SATA 物理层错误计数
A9=坏块数总计
AD=擦除计数
C0=意外断电计数
C2=温度
C4=重新分配事件计数
C5=有待处置扇区数
C6=不可校正扇区计数
F1=主机总计写入
F2=主机总计读取

[SmartSanDiskGb] ;Added 6.2.0
01=读取错误率
05=重新分配块计数
09=通电时间(小时)
0C=通电次数
A5=SLC 块擦除计数
A6=最小 PE(编程/擦除) 次数
A7=单个裸片中坏块数 (最大)
A8=最大 P/E 次数
A9=坏块总计
AA=增长坏块
AB=编程失败计数
AC=擦除失败计数
AD=平均 PE(编程/擦除) 次数
AE=意外断电计数
B8=端到端错误检测/校正计数
BB=报告的不可校正错误
BC=命令超时计数
C2=温度
C7=CRC 错误计数
D4=SATA 物理层错误计数
E6=介质磨损指示器
E7=SSD 剩余寿命
E8=剩余备用块计数
E9=NAND 已写入 (GB)
EA=NAND 已写入 (SLC) (GB)
EE=介质磨损指示器 (剩余循环次数)
F1=总计写入 (GB)
F2=总计读取 (GB)
F4=温度门限状态
F9=NAND 已写入 (GB)

[SmartKingston] ;Added 6.6.0
;https://media.kingston.com/support/downloads/MKP_521_Phison_SMART_attribute.pdf
01=读取错误率
02=吞吐性能
03=起转时间
05=重新分配扇区计数
07=寻道错误率
08=寻道时间性能
09=通电时间(小时)
0A=起转重试次数
0C=通电次数
A8=SATA 物理层错误计数
AA=坏块计数
AD=擦除计数
AF=坏簇表计数
BB=不可校正错误计数
C0=不安全关机计数
C2=温度
C4=出厂后坏块
C5=有待处置扇区数
C7=CRC 错误计数
DA=CRC 错误计数
E7=SSD 剩余寿命
E9=总计写入闪存
F0=写头
F1=主机总计写入
F2=主机总计读取
F4=平均擦除计数
F5=最大擦除计数
F6=总计擦除计数

[SmartNVMe] ;Added 9.7.0
01=严重警告标志
02=综合温度
03=可用备用空间
04=可用备用空间阈值
05=已用寿命百分比
06=读取单位计数
07=写入单位计数
08=主机读命令计数
09=主机写命令计数
0A=控制器忙状态时间
0B=启动-关闭循环次数
0C=通电时间(小时)
0D=不安全关机计数
0E=介质与数据完整性错误计数
0F=错误日志项数
10=警告综合温度时间
11=严重综合温度时间
12=温度传感器 1
13=温度传感器 2
14=温度传感器 3
15=温度传感器 4
16=温度传感器 5
17=温度传感器 6
18=温度传感器 7
19=温度传感器 8
1A=热管理温度 1 转换次数
1B=热管理温度 2 转换次数
1C=热管理温度 1 总时间
1D=热管理温度 2 总时间

[SmartRealtek] ;Added by Realtek
01=原始数据错误率
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
A1=GDN
A2=擦除计数总计
A3=最大 PE(编程/擦除) 次数
A4=平均擦除计数
A5=初始坏块数
A6=总计坏块数
A7=固态硬盘保护模式 (只读不写)
A8=SATA 物理层错误计数
A9=健康状态
AB=编程失败计数
AC=擦除失败计数
AE=意外断电计数
AF=ECC 校正失败计数
B5=未对齐访问计数
BB=报告的不可校正错误
C2=外壳温度
C3=ECC 成功校正累计
C4=重新分配事件计数
C7=Ultra DMA CRC 错误计数
CE=最小擦除计数
CF=最大擦除计数
E7=剩余寿命
E8=可用保留空间
F1=写入寿命
F2=读取寿命
F9=NAND 总计写入 (GB)
FA=NAND 总计写入 (GB) (SLC)

[SmartSKhynix] ; Updated 8.8.0
01=读取错误率
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
64=总计擦除计数
A8=最小擦除计数
A9=最大擦除计数
AA=保留块计数
AB=编程失败计数
AC=擦除失败计数
AE=意外断电计数
AF=编程失败计数 (最坏情况)
B0=擦除失败计数 (最坏情况)
B1=闪存磨损平均计数
B2=已用保留块计数 (最坏情况)
B3=已用保留块计数 (SSD 总计)
B4=未用保留块计数 (SSD 总计)
B5=编程失败计数 (SSD 总计)
B6=擦除失败计数 (SSD 总计)
B7=SATA 接口性能降级计数
B8=端到端错误检测计数
BB=已报告的不可校正错误
BC=命令超时计数
BF=Op Shock 事件计数
C2=温度
C3=ECC 率
C4=重新分配事件计数
C6=不可校正扇区计数
C7=CRC 错误计数
C9=不可校正的软读取错误率
CC=软 ECC 校正
D4=物理层错误计数
E7=SSD 剩余寿命
E9=SSD 剩余寿命
EA=NAND 写入量
F1=LBA(逻辑区块地址)写入总计
F2=LBA(逻辑区块地址)读取总计
FA=NAND 读取重试总计

[SmartKioxia] ; Added 8.8.0
09=通电时间(小时)
0C=通电次数
A7=固态硬盘保护模式 (只读不写)
A8=SATA 物理层错误计数
A9=坏块计数
AD=擦除计数 (用户数据)
C0=意外断电计数
C2=温度
F1=主机写入

[SmartWdc]
01=读取错误率
05=重新分配块计数
09=通电时间(小时)
0C=通电次数
A5=块擦除计数 (SLC)
A6=最小 PE(编程/擦除) 次数
A7=单个裸片中坏块数 (最大)
A8=最大 PE(编程/擦除) 次数
A9=坏块总计
AA=新增坏块
AB=编程失败计数
AC=擦除失败计数
AD=平均 PE(编程/擦除) 次数
AE=意外断电计数
B8=端到端错误检测/校正计数
BB=报告的不可校正的错误
BC=命令超时计数
C2=温度
C7=CRC 错误计数
D4=SATA 物理层错误计数
E6=介质磨损指示器
E8=剩余备用块计数
E9=NAND 总计写入
EA=NAND 总计写入 (SLC)
EE=介质磨损指示器 (剩余循环)
F1=总计写入 (GB)
F2=总计读取 (GB)
F3=NAND 总计写入
F4=温控状态
F9=NAND 已写入 (GB)

[SmartKingstonSuv]
; https://media.kingston.com/support/downloads/UV400-SMART-attribute.pdf
; https://media.kingston.com/support/downloads/UV500_SMART_attribute.pdf
01=读取错误率
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
AA=已使用的保留块计数
AB=编程失败计数
AC=擦除失败计数
AE=意外断电计数
AF=编程失败计数 (最差的 Die)
B0=擦除失败计数 (最差的 Die)
B1=闪存磨损平均计数
B2=已使用的保留块计数 (最差的 Die)
B4=未使用的保留块计数 (SSD 整体)
BB=报告的不可校正的错误
C2=温度
C3=动态 ECC 错误计数
C4=重新分配事件计数
C5=有待处置扇区数
C7=UDMA CRC 错误计数
C9=不可校正的读取错误率
CC=软 ECC 校正率
E7=SSD 剩余寿命
EA=总计 NAND 写入
F1=总计主机写入
F2=总计主机读取
FA=NAND 读取重试总计

[SmartKingstonKC600]
;https://media.kingston.com/support/downloads/KC600-SMART-attribute.pdf
01=读取错误率
05=重新分配的 NAND 块数
09=通电时间(小时)
0C=通电次数
94=预留
95=预留
96=预留
97=SLC 平均擦除计数
9F=DRAM 1 比特位错误计数
A0=报告的 UECC(不可校正)错误
A1=可用保留空间
A4=预留
A5=预留
A6=预留
A7=平均擦除计数
A8=预留
A9=额定寿命剩余百分比
B1=预留
B5=编程失败计数
B6=擦除失败计数
C0=意外断电计数
C2=温度
C3=硬件 ECC 已修复错误计数
C4=重新分配事件计数
C7=UDMA CRC 错误计数
E7=额定寿命剩余百分比
E8=未使用的保留块计数
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计
F5=介质总写入

[SmartKingstonDC500]
;https://media.kingston.com/support/pdf/MKP_521-7_SMART-DC500_attribute_hr.pdf
01=主机不可校正错误计数
09=通电时间(小时)
0C=通电次数
A7=保护模式 (只读不写)
A8=SATA 物理层错误计数
A9=坏块率
AA=坏块信息
AC=擦除失败计数
AD=擦除计数
B5=编程失败计数
B6=擦除失败计数
BB=主机不可校正错误计数
C0=意外断电计数
C2=温度
C4=出厂后坏块总计
C7=CRC 错误计数
CF=温控计数
DA=CRC 错误计数
E7=SSD 剩余寿命
E8=读取失败计数
E9=NAND 写入
F1=主机写入
F2=主机读取
F4=平均擦除计数
F5=最大擦除计数
F6=最小擦除计数

[SmartKingstonSA400]
;https://github.com/hiyohiyo/CrystalDiskInfo/issues/20
01=不可校正错误计数
09=通电时间(小时)
0C=通电次数
94=厂商特定项目
95=厂商特定项目
A7=厂商特定项目
A8=SATA 物理层错误计数
A9=厂商特定项目
AA=坏块计数
AC=厂商特定项目
AD=擦除计数
B5=厂商特定项目
B6=厂商特定项目
BB=不可校正的 ECC 错误
C2=温度
C4=重新分配事件
C7=SATA CRC 错误计数
DA=CRC 错误计数
E7=SSD 磨损指示器
E9=总计 NAND 写入
F1=总计主机写入
F2=总计主机读取
F4=平均擦除计数
F5=最大擦除计数
F6=总计擦除计数

[SmartSsstc]
01=原始读取错误率
05=重新分配块计数
09=通电时间(小时)
0C=通电次数
AA=可用保留空间
AB=编程失败计数
AC=擦除失败计数
AD=平均编程/擦除(P/E)计数
AE=意外断电计数
AF=编程失败计数(最坏情况)
B0=擦除失败计数(最坏情况)
B1=闪存磨损平均计数
B2=已使用的保留块计数(最坏情况)
B3=已使用的保留块计数(总计)
B4=未使用的保留块计数(总计)
B7=SATA 接口性能降级
B8=端到端数据错误计数
BB=不可校正错误计数
BC=命令超时
C2=温度
C3=ECC 等级
C6=离线不可校正错误计数
C7=SATA CRC 错误计数
E5=掉电保护失败
E7=剩余寿命百分比
E8=可用保留空间 
E9=NAND 已写入 (GB)
F1=主机总写入
F2=主机总读取
F3=NAND 已写入 (GB)

[SmartIntelDc]
;https://github.com/hiyohiyo/CrystalDiskInfo/issues/18
01=原始数据读取错误计数
05=重新分配闪存块计数
09=通电时间(小时)
0C=通电次数
0E=设备容量
0F=用户容量
10=可用备用块
11=可用剩余备用
AC=块擦除失败总计
AD=每块最大擦除计数
AE=意外断电计数
AF=平均擦除计数
B0=掉电保护错误
B5=块程序失败总计
B8=端到端错误检测计数
BB=不可校正错误计数
C2=温度
C5=有待处置扇区数
C6=离线不可校正错误计数
C7=CRC 错误计数
CA=已使用寿命百分比
E2=特定周期内工作负载 - 介质磨损
E3=特定周期内工作负载 - 主机读/写比率
E4=特定周期内工作负载计时器
EA=温控状态
EB=主机总计写入字节/扇区
F1=NAND 总计写入字节/扇区

[SmartApacer]
09=通电时间(小时)
0C=通电次数
A3=最大擦除计数
A4=平均擦除计数
A6=出厂后坏块数总计
A7=固态硬盘保护模式 (只读不写)
A8=SATA 物理层错误计数
AB=编程失败计数
AC=擦除失败计数
AF=坏簇表计数
C0=意外断电计数
C2=温度
E7=剩余周期
F1=扇区写入总计

[SmartSiliconMotion]
01=读取错误率
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
94=SLC 擦除计数总计
95=SLC 最大擦除计数
96=SLC 最小擦除计数
97=SLC 平均擦除计数
9F=DRAM 1 比特位错误计数
A0=读/写时不可校正的扇区计数
A1=有效备用块数
A2=缓存数据块数
A3=初始无效块数
A4=擦除计数总计
A5=最大擦除计数
A6=最小擦除计数
A7=平均擦除计数
A8=Spec 最大擦除计数
A9=剩余寿命
AF=程序失败计数 (最差的 Die)
B0=擦除失败计数 (最差的 Die)
B1=磨损程度总计
B2=运行中的无效块计数
B5=编程失败计数
B6=擦除失败计数
BB=不可校正错误计数
C0=断电重启计数
C2=温度
C3=硬件 ECC 已校正错误计数
C4=重新分配事件计数
C5=有待处置扇区数
C6=离线不可校正的错误计数
C7=Ultra DMA CRC 错误计数
E8=可用保留空间
F1=LBA 写入总计
F2=LBA 读取总计
F5=闪存写入扇区计数

[SmartJMicron66x]
01=读取错误率
02=吞吐性能
03=起转时间
05=重新分配扇区计数
07=寻址错误率
08=寻址时间性能
09=通电时间(小时)
0A=起转重试次数
0C=通电次数
A7=固态硬盘保护模式 (只读不写)
A8=SATA 物理层错误计数
AA=坏块计数
AD=擦除计数
AF=坏簇表计数
B4=备用块计数
C0=意外断电计数
C2=温度
C5=有待处置扇区数
E7=使用寿命
E9=写入扇区计数 (NAND)
F0=写磁头
F1=主机总写入
F2=主机总读取

[SmartPhison]
01=读取错误率
09=通电时间(小时)
0C=通电次数
A8=SATA 物理层错误计数
AA=坏块计数
AD=擦除计数
C0=意外断电计数
C2=温度
DA=CRC 错误计数
E7=SSD 剩余寿命
F1=主机写入

[SmartSeagate]
; https://crystalmark.info/board/c-board.cgi?cmd=one;no=1818;id=#1818
01=读取错误率
05=老化扇区数
09=通电时间(小时)
0C=通电次数
10=可用备用块
11=剩余备用块计数
A8=SATA 物理层错误计数
AA=坏块计数
AB=编程失败计数
AC=擦除失败计数
AD=擦除计数
AE=意外断电计数
B1=磨损范围增量
B5=编程失败计数
B6=擦除失败计数
C0=意外断电计数
C2=温度
C9=软错误率 
CC=软 ECC 校正率
DA=CRC 错误计数
E7=SSD 剩余寿命
E8=读取失败块数
E9=NAND 写入 (GiB)
EA=总计闪存写入
EB=NAND 扇区写入
F1=总计主机写入
F2=总计主机读取
FA=总计 NAND 读取重试

[SmartSeagateIronWolf]
; https://www.seagate.com/cn/zh/support/internal-hard-drives/nas-drives/ironwolf-ssd/#specs
01=原始读取错误率
05=重新分配扇区计数
09=通电时间(小时)
0C=通电次数
64=闪存已擦除 (GiB)
66=进入 PS4 电源状态总计
67=进入 PS3 电源状态总计
AA=增长坏块计数
AB=编程失败计数
AC=擦除失败计数
AD=平均编程/擦除(P/E)计数
AE=意外断电计数
B1=磨损范围增量
B7=SATA/PCIe 接口性能降级计数
BB=不可校正 ECC 错误计数
C2=温度
C3=希捷 RAISE 阵列成功恢复 ECC 错误计数
C6=不可校正的读取错误计数
C7=SATA 读取 CRC 错误计数
E6=寿命保护状态
E7=SSD 剩余寿命
E8=可用保留空间
E9=总计闪存写入
F1=总计主机写入
F2=总计主机读取
F3=空闲空间

[SmartMarvell] ; Added 8.8.3
05=新增坏块数
09=通电时间(小时)
0C=启动-关闭循环次数
A4=擦除计数总计
A5=最大擦除计数
A6=最小擦除计数
A7=平均擦除计数
C0=断电重启计数
C2=温度
C7=SATA CRC 错误计数
F1=主机总写入
F2=主机总读取

[SmartMaxiotek] ; Added 8.8.6
05=重新分配扇区数
09=通电时间(小时)
0C=通电次数
A7=固态硬盘保护模式 (只读不写)
A8=物理层错误计数
A9=坏块计数
AB=编程失败计数
AC=擦除失败计数
AD=擦除计数
AF=坏簇表计数
B1=读取重试计数
B4=剩余备用块计数计数
BB=报告的不可校正错误计数
C0=意外断电计数
C2=温度
C4=重新分配事件计数
C7=UDMA CRC 错误计数
CE=最小擦除计数
CF=最大擦除计数
D0=平均擦除计数
D1=SLC 块最小擦除计数
D2=SLC 块最大擦除计数
D3=SLC 块平均擦除计数
E7=SSD 剩余寿命
E9=扇区到 NAND 写入计数
EA=扇区从 NAND 读取计数
F1=写入扇区计数
F2=读取扇区计数
F5=Bit 错误计数

[SmartSeagateBarraCuda] ; Added 8.9.0
01=UECC(不可校正)错误计数
05=老化扇区数
09=通电时间(小时)
0C=通电次数
10=可用备用块
11=剩余备用块计数
A8=SATA 物理层错误计数
AA=坏块计数
AB=编程失败计数
AC=擦除失败计数
AD=擦除计数
AE=意外断电计数
B1=磨损范围增量
B5=编程失败计数
B6=擦除失败计数
C0=意外断电计数
C2=温度
C9=软错误率 
CC=软 ECC 校正率
DA=CRC 错误计数
E7=SSD 剩余寿命
E8=读取失败块数
E9=NAND 已写入 (GiB)
EA=总计闪存写入
EB=NAND 扇区写入
F1=总计主机写入
F2=总计主机读取
FA=总计 NAND 读取重试

[SmartYmtc] ; Added 8.10.0
05=新增坏块计数
09=通电时间(小时)
0C=通电次数
AA=最大坏块计数
A8=SATA 物理层错误计数
A9=坏块计数
AB=编程失败计数
AC=擦除失败计数
AD=擦除计数
AF=坏簇表计数
B7=SATA 接口性能降级计数
B8=端到端错误检测/校正计数
BB=不可校正错误计数
BE=温度
C0=意外断电计数
C4=重新分配事件计数
C7=CRC 错误计数
CE=最小擦除计数
CF=最大擦除计数
D0=平均擦除计数
D1=SLC 块最小擦除计数
D2=SLC 块最大擦除计数
D3=SLC 块平均擦除计数
E7=SSD 剩余寿命
E9=扇区到 NAND 写入计数
EA=扇区从 NAND 读取计数
F1=主机总写入
F2=主机总读取
F3=NAND 温度
F5=Bit 错误计数

[SmartScy] ;Added 8.12.8
01=原始读取错误率
05=重新分配扇区计数
07=寻址错误率
09=通电时间(小时)
0C=通电次数
A7=平均擦除计数
AB=编程失败计数
AC=擦除失败计数
AD=擦除计数
B1=读取重试计数
B4=剩余备用块计数
B7=运行期间坏块
BB=已报告 UNC 错误次数
C0=不安全关机计数
C2=受控温度
C3=ECC 纠正比特误码累计次数
C4=重分配事件计数
C5=有待处置扇区
C7=UDMA CRC 错误计数
E7=SSD 剩余寿命
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计
F5=Nand 闪存写入量总计

[SmartRecadata] ;Added 8.14.0
07=寻址错误率
09=通电时间(小时)
0C=驱动器通电次数
A7=平均擦除计数
AB=编程失败计数
AC=擦除失败计数
AD=擦除计数
B1=读取重试计数
B4=剩余备用块计数
B7=运行期间坏块
BB=已报告 UNC 错误次数
C0=不安全关机计数
C2=受控温度
C3=ECC 纠正比特误码累计次数
C4=重分配事件计数
C5=有待处置扇区
C7=UDMA CRC 错误计数
E7=SSD 剩余寿命
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计
F5=Nand 闪存写入量总计

[SmartSanDiskHp] ;Added 8.17.0
01=原始读取错误率
05=重新分配块数
09=通电时间(小时)
0C=驱动器通电次数
AA=已保留块计数量
AB=编程失败计数
AC=擦除失败计数
AD=闪存磨损平均计数
AE=不安全关机计数
B0=未使用的已保留块计数量
B7=SATA 接口性能降级次数
B8=端到端错误检测与纠正次数
BB=不可校正错误计数
BC=命令超时
BE=气流温度
C2=温度
C4=重分配事件计数
C7=CRC 错误计数
C9=SSD 剩余寿命
E6=介质磨损指示器
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计
F3=温控统计
F4=温控墙状态
F9=TLC NAND 已写入 (GB)

[SmartSanDiskHpVenus] ;Added 8.17.0
01=原始读取错误率
05=重新分配块数
09=通电时间(小时)
0C=驱动器通电次数
AA=已保留块计数量
AB=编程失败计数
AC=擦除失败计数
AD=闪存磨损平均计数
AE=不安全关机计数
B0=未使用的已保留块计数量
B7=SATA 接口性能降级次数
B8=端到端错误检测与纠正次数
BB=不可校正错误计数
BC=命令超时
BE=气流温度
C2=温度
C4=重分配事件计数
C7=CRC 错误计数
C9=SSD 剩余寿命
E6=介质磨损指示器
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计
F3=NAND 总计写入
F4=温控墙状态
F9=TLC NAND 已写入 (GB)

[SmartSanDiskDell] ;Added 8.17.0
05=重新分配块数
09=通电时间(小时)
0C=驱动器通电次数
AF=编程失败计数 (最差组件)
B0=擦除失败计数 (最差组件)
B1=闪存磨损平均计数
B2=已使用的保留块计数量 (最差组件)
B3=已使用的保留块计数量 (SSD 整体)
B4=剩余的保留块计数量 (SSD 整体)
B5=编程失败计数 (SSD 整体)
B6=擦除失败计数 (SSD 整体)
BB=不可校正错误计数
C2=温度
C3=ECC 率
C7=CRC 错误计数
E6=介质磨损指示器
EE=介质磨损指示器 (剩余循环周期)
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计

[SmartSanDiskLenovo] ;Added 8.17.0
05=重新分配块数
09=通电时间(小时)
0C=驱动器通电次数
A6=最小 PE(编程/擦除) 次数
A7=单个裸片中坏块数 (最大)
A8=最大 P/E 次数
A9=总计坏块
AA=增长坏块
AB=编程失败计数
AC=擦除失败计数
AD=平均 P/E 次数属性
AE=不安全关机计数
B2=已使用的保留块计数量
B4=剩余的保留块计数量
B8=端到端错误检测与纠正次数
BB=UECC(不可校正)错误次数
BC=命令超时
C2=温度
C7=SATA CRC 错误
D4=SATA 物理层错误计数
E6=介质磨损指示器
E8=可用保留空间
E9=NAND 已写入 (GB)
EA=SLC NAND 已写入 (GB)
F1=主机总计写入 (GB)
F2=总计读取 (GB)
F3=温控统计
F4=温控墙状态

[SmartSanDiskLenovoHelenVenus] ;Added 8.17.0
05=重新分配块数
09=通电时间(小时)
0C=驱动器通电次数
A6=最小 PE(编程/擦除) 次数
A7=单个裸片中坏块数 (最大)
A8=最大 P/E 次数
A9=总计坏块
AA=增长坏块
AB=编程失败计数
AC=擦除失败计数
AD=平均 P/E 次数属性
AE=不安全关机计数
B2=已使用的保留块计数量
B4=剩余的保留块计数量
B8=端到端错误检测与纠正次数
BB=UECC(不可校正)错误次数
BC=命令超时
C2=温度
C7=SATA CRC 错误
D4=SATA 物理层错误计数
E8=可用保留空间
E9=介质磨损指示器
EA=SLC NAND 已写入 (GB)
F1=主机总计写入 (GB)
F2=总计读取 (GB)
F3=温控统计
F4=温控墙状态
F9=TLC NAND 已写入 (GB)

[SmartMicronMU03] ;Added 8.17.0
01=原始读取错误率
05=重新分配 NAND 块数
09=通电时间(小时)
0C=通电次数
AB=编程失败计数
AC=擦除失败计数
AD=平均擦除块数
AE=不安全关机计数
B4=未使用的备用 NAND 块
B5=4K 未对齐的访问
B7=SATA 接口性能降级
B8=错误校正计数
BB=报告的不可校正错误
C2=温度
C4=重分配事件计数
C5=当前待定 ECC 计数
C6=SMART 离线扫描不可校正错误计数
C7=UDMA CRC 错误计数
CA=剩余寿命
CE=写入错误率
D2=RAIN(独立 NAND 冗余阵列)成功恢复计数
F0=主机编程页次数
F1=LBA(逻辑区块地址)写入量总计
F2=LBA(逻辑区块地址)读取量总计
F3=总计编程页次数
F6=主机累计写入扇区
F7=主机编程 NAND 页计数
F8=FTL 编程 NAND 页计数

[SmartSanDiskCloud] ;Added 9.0.0
05=重新分配扇区计数
09=通电时间(小时)
0D=UECC(不可校正)错误次数
20=写入放大系数乘以100
21=写入放大系数
AA=保留块计数
AB=编程失败计数
AC=擦除失败计数
AD=平均写入/擦除计数
AE=意外断电计数
B2=SSD 剩余寿命(最高0.01%)
BF=干净关机次数
C0=非干净关机次数
C2=温度
C4=重新分配的块数量
E6=总计写入/擦除计数的百分比
E8=剩余寿命
E9=总 NAND 写入 64GB
EB=电容健康状况
F1=总主机写入 64GB
F2=总主机读取 64GB
F4=终身热节流激活次数
F5=剩余寿命百分比
FD=剩余 SPI 测试

[SmartSiliconMotionCVC] ;Added 9.3.0
05=重新分配计数
09=通电时间(小时)
0C=驱动器通电次数
A5=单层单元缓存
AA=增长坏块计数
AB=编程失败计数
AC=擦除失败计数
AD=平均擦除计数
AE=意外断电计数
AF=编程失败计数(最坏情况)
B7=总 SATA 链路速度降级
B8=已校正的端到端数据错误
BB=不可校正错误计数
BD=最大擦除计数
BE=温度
BF=最小擦除计数
C3=读取错误率
C6=离线扫描不可纠正扇区计数
C7=SATA CRC 错误计数
CA=SSD 剩余寿命
E8=总备用计数
E9=TLC NAND 写入
F1=主机写入
F2=主机读取
94=RAID 事件计数
95=RAID 不可纠正计数
A7=固态硬盘保护模式(只读不写)
93=软重试事件计数
EA=SLC NAND 写入

[SmartAdataIndustrial] ;Added 9.3.1
09=通电时间(小时)
0C=驱动器通电次数
A7=固态硬盘保护模式(只读不写)
A8=SATA 物理层错误计数
A9=坏块计数
AD=擦除计数
AF=坏簇表计数
B4=剩余备用块计数计数
C0=意外断电计数
C2=温度
E7=SSD 剩余寿命
E9=闪存写入扇区计数
EA=Flash 读取扇区计数
F1=写入扇区计数
F2=读取扇区计数
